# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.


# st = 'as 23 fdfdg544'
# print(st)
#
# i=0
# while i < len(st):
#     if st[i].isdigit():
#         print(st[i], end=", ")
#     i +=1

# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st =  #введена строка
#   23, 544, 34              #вивело в консолі

# st = 'as 23 as 23 fdfdg544 34'
# i=0
# k=0
# while i < len(st):
#     if st[i].isdigit():
#         j=i
#         while j < len(st) and st[j].isdigit():
#             print(st[j], end="")
#             j +=1
#             k+=1
#         print(end=",")
#     if k>0:
#         i= i+k
#     else: i=i+1
#     k=0

# list comprehension
#
# 1)есть строка:
# greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# пример:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
#
# greeting = 'Hello, world'
# letters = [i.upper() for i in greeting]
# print(letters)

# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]

# odd=[i*i for i in range(50) if i*i%2 == 1]
# print(odd)
#
# function
#
# - створити функцію яка виводить ліст


# def func(list):
#     print(list)
#
# func([1,2,3])
#
# створити функцію яка приймає три числа та виводить та повертає найменьше.
# def func(a, b, c):
#     print(min(a, b, c))
#     return min((a, b, c))
#
#
# print(func(5, 56, 8))


# - створити функцію яка приймає три числа та виводить та повертає найбільше.

# def maxel(a, b, c):
#     print(max(a, b, c))
#     return max((a, b, c))
#
#
# print(maxel(5, 56, 8))

# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
#
# def maxmin(*args):
#     print(max(args))
#     return min(args)
#
#
# print(maxmin(5, 56, 8, 5, 8, -9, -969, -45, 89, 100, -89))

# - створити функцію яка повертає найбільше число з ліста

# def func(list):
#     print(max(list))
#
#
# func([1, 2, 3, 5, 45, -89])

# - створити функцію яка повертає найменьше число з ліста
#
# def func(list):
#     print(min(list))
#
#
# func([1, 2, 3, 5, 45, -89])

# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.

# def func(list):
#     print(sum(list))
#
#
# func([1, 2, 3])

# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.

# def func(list):
#     print(sum(list)/len(list))
#
#
# func([1, 2, 3, 4, 5])

# decorators
# - є функція:
# def pr():
#     return 'Hello_boss_!!!'
#  написати декоратор до цієї функції, який замінює нижні підчеркування на пробіли і повертає це значення


def decor(func):
    def wrap():
        print(func().replace("_", " "))
    return wrap

@decor
def pr():
    return 'Hello_boss_!!!'

pr()
